// Игра «Переверни текст»





// Игра «Викторина»
// Массив вопросов и правильных ответов
const quiz = [
    {
        question: "Какой цвет небо?",
        options: ["1. Красный", "2. Синий", "3. Зеленый"],
        correctAnswer: 2 // номер правильного ответа
    },
    {
        question: "Сколько дней в неделе?",
        options: ["1. Шесть", "2. Семь", "3. Восемь"],
        correctAnswer: 2
    },
    {
        question: "Сколько у человека пальцев на одной руке?",
        options: ["1. Четыре", "2. Пять", "3. Шесть"],
        correctAnswer: 2
    }
];


// ------------------
// Задание 1
// Преобразовать строку 'js' в верхний регистр.
console.log('Задание 1');
let str1='js';
console.log(str1.toLocaleUpperCase());



// Задание 2
// Создать функцию, которая принимает массив строк и строку. Функция должна вернуть новый массив, содержащий только те элементы первого массива, которые начинаются со второй строки. Регистр символов не влияет на результат.
console.log('Задание 2');



// Задание 3
// Округлить число 32.58884:

// До меньшего целого.
// До большего целого.
// До ближайшего целого.
console.log('Задание 3');


// Задание 4
// Найти минимальное и максимальное значения из чисел 52, 53, 49, 77, 21, 32 и вывести их в консоль.
console.log('Задание 4');




// Задание 5
// Создать функцию, которая выводит в консоль случайное число от 1 до 10.
console.log('Задание 5');



// Задание 6
// Написать функцию, которая принимает целое число и возвращает массив случайных чисел от 0 до этого числа. Длина массива должна быть в два раза меньше переданного числа.
console.log('Задание 6');




// Задание 7
// Создать функцию, которая принимает два целых числа и возвращает случайное число в этом диапазоне.
console.log('Задание 7');




// Задание 8
// Вывести в консоль текущую дату.
console.log('Задание 8');




// Задание 9
// Создать переменную 
// currentDate, хранящую текущую дату. Вывести дату, которая наступит через 73 дня после текущей.
console.log('Задание 9');



// Задание 10
// Написать функцию, которая принимает дату и возвращает ее в формате:
// Дата: [число] [месяц на русском] [год] — это [день недели на русском].
// Время: [часы]:[минуты]:[секунды]
console.log('Задание 10');




